In [2]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [6]:
ser1 = Series(np.arange(3),index=['LA', 'NY', 'DC'])
ser1 = ser1 * 2
ser1

LA    0
NY    2
DC    4
dtype: int64

In [7]:
ser1['NY']

2

In [10]:
ser1[1]

2

In [11]:
ser1[1:3]

NY    2
DC    4
dtype: int64

In [12]:
ser1[['LA', 'DC']]

LA    0
DC    4
dtype: int64

In [13]:
ser1[ser1 > 2]

DC    4
dtype: int64

In [15]:
ser1[ser1 > 2] = 40
ser1

LA     0
NY     2
DC    40
dtype: int64

In [17]:
dframe = DataFrame(np.arange(25).reshape(5,5), index = ['LA','NY','TX','DC','CH'], columns = ['1','2','3','4','5'])
dframe

     1   2   3   4   5
LA   0   1   2   3   4
NY   5   6   7   8   9
TX  10  11  12  13  14
DC  15  16  17  18  19
CH  20  21  22  23  24

In [20]:
dframe[['2']]

     2
LA   1
NY   6
TX  11
DC  16
CH  21

In [23]:
dframe[[2,3]]

     3   4
LA   2   3
NY   7   8
TX  12  13
DC  17  18
CH  22  23

In [24]:
dframe[['1','5']]

     1   5
LA   0   4
NY   5   9
TX  10  14
DC  15  19
CH  20  24

In [25]:
dframe[dframe['3'] > 8]

     1   2   3   4   5
TX  10  11  12  13  14
DC  15  16  17  18  19
CH  20  21  22  23  24

In [26]:
dframe > 8

        1      2      3      4      5
LA  False  False  False  False  False
NY  False  False  False  False   True
TX   True   True   True   True   True
DC   True   True   True   True   True
CH   True   True   True   True   True

In [31]:
dframe[(dframe < 5) | (dframe > 10)]

     1   2   3   4   5
LA   0   1   2   3   4
NY NaN NaN NaN NaN NaN
TX NaN  11  12  13  14
DC  15  16  17  18  19
CH  20  21  22  23  24

In [32]:
dframe.ix['NY']

1    5
2    6
3    7
4    8
5    9
Name: NY, dtype: int64

In [33]:
dframe.ix[3]

1    15
2    16
3    17
4    18
5    19
Name: DC, dtype: int64